; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_7)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 - link
    angle0 angle20 angle40 angle60 angle80 angle100 angle120 angle140 angle160 angle180 angle200 angle220 angle240 angle260 angle280 angle300 angle320 angle340 - angle)
(:init
    (AngleOrd angle0 angle20)
    (AngleOrd angle20 angle40)
    (AngleOrd angle40 angle60)
    (AngleOrd angle60 angle80)
    (AngleOrd angle80 angle100)
    (AngleOrd angle100 angle120)
    (AngleOrd angle120 angle140)
    (AngleOrd angle140 angle160)
    (AngleOrd angle160 angle180)
    (AngleOrd angle180 angle200)
    (AngleOrd angle200 angle220)
    (AngleOrd angle220 angle240)
    (AngleOrd angle240 angle260)
    (AngleOrd angle260 angle280)
    (AngleOrd angle280 angle300)
    (AngleOrd angle300 angle320)
    (AngleOrd angle320 angle340)
    (AngleOrd angle340 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)

    (HasAngle angle240 link1)
    (HasAngle angle60 link2)
    (HasAngle angle60 link3)
    (HasAngle angle200 link4)
    (HasAngle angle180 link5)
    (HasAngle angle140 link6)
    (HasAngle angle20 link7)
    (HasAngle angle20 link8)
)
(:goal
(and
    (HasAngle angle200 link1)
    (HasAngle angle200 link2)
    (HasAngle angle60 link3)
    (HasAngle angle60 link4)
    (HasAngle angle320 link5)
    (HasAngle angle120 link6)
    (HasAngle angle320 link7)
    (HasAngle angle300 link8)
    )
)
)

; plan
1. (decrease_angle link1 angle240 angle220)
   deleted: (hasangle angle240 link1) (hasangle angle60 link2) (hasangle angle60 link3) (hasangle angle200 link4) (hasangle angle180 link5) (hasangle angle140 link6) (hasangle angle20 link7) (hasangle angle20 link8)
   added: (hasangle angle220 link1) (hasangle angle40 link2) (hasangle angle40 link3) (hasangle angle180 link4) (hasangle angle160 link5) (hasangle angle120 link6) (hasangle angle0 link7) (hasangle angle0 link8)
   goals met: 1 of 8
2. (decrease_angle link1 angle220 angle200)
   deleted: (hasangle angle220 link1) (hasangle angle40 link2) (hasangle angle40 link3) (hasangle angle180 link4) (hasangle angle160 link5) (hasangle angle120 link6) (hasangle angle0 link7) (hasangle angle0 link8)
   added: (hasangle angle200 link1) (hasangle angle20 link2) (hasangle angle20 link3) (hasangle angle160 link4) (hasangle angle140 link5) (hasangle angle100 link6) (hasangle angle340 link7) (hasangle angle340 link8)
   goals met: 1 of 8
3. (decrease_angle link1 angle200 angle180)
   deleted: (hasangle angle200 link1) (hasangle angle20 link2) (hasangle angle20 link3) (hasangle angle160 link4) (hasangle angle140 link5) (hasangle angle100 link6) (hasangle angle340 link7) (hasangle angle340 link8)
   added: (hasangle angle180 link1) (hasangle angle0 link2) (hasangle angle0 link3) (hasangle angle140 link4) (hasangle angle120 link5) (hasangle angle80 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   goals met: 1 of 8
4. (decrease_angle link2 angle0 angle340)
   deleted: (hasangle angle0 link2) (hasangle angle0 link3) (hasangle angle140 link4) (hasangle angle120 link5) (hasangle angle80 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   added: (hasangle angle340 link2) (hasangle angle340 link3) (hasangle angle120 link4) (hasangle angle100 link5) (hasangle angle60 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   goals met: 1 of 8
5. (decrease_angle link2 angle340 angle320)
   deleted: (hasangle angle340 link2) (hasangle angle340 link3) (hasangle angle120 link4) (hasangle angle100 link5) (hasangle angle60 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   added: (hasangle angle320 link2) (hasangle angle320 link3) (hasangle angle100 link4) (hasangle angle80 link5) (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   goals met: 0 of 8
6. (decrease_angle link2 angle320 angle300)
   deleted: (hasangle angle320 link2) (hasangle angle320 link3) (hasangle angle100 link4) (hasangle angle80 link5) (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   added: (hasangle angle300 link2) (hasangle angle300 link3) (hasangle angle80 link4) (hasangle angle60 link5) (hasangle angle20 link6) (hasangle angle260 link7) (hasangle angle260 link8)
   goals met: 0 of 8
7. (decrease_angle link2 angle300 angle280)
   deleted: (hasangle angle300 link2) (hasangle angle300 link3) (hasangle angle80 link4) (hasangle angle60 link5) (hasangle angle20 link6) (hasangle angle260 link7) (hasangle angle260 link8)
   added: (hasangle angle280 link2) (hasangle angle280 link3) (hasangle angle60 link4) (hasangle angle40 link5) (hasangle angle0 link6) (hasangle angle240 link7) (hasangle angle240 link8)
   goals met: 1 of 8
8. (increase_angle link3 angle280 angle300)
   deleted: (hasangle angle280 link3) (hasangle angle60 link4) (hasangle angle40 link5) (hasangle angle0 link6) (hasangle angle240 link7) (hasangle angle240 link8)
   added: (hasangle angle300 link3) (hasangle angle80 link4) (hasangle angle60 link5) (hasangle angle20 link6) (hasangle angle260 link7) (hasangle angle260 link8)
   goals met: 0 of 8
9. (decrease_angle link2 angle280 angle260)
   deleted: (hasangle angle280 link2) (hasangle angle300 link3) (hasangle angle80 link4) (hasangle angle60 link5) (hasangle angle20 link6) (hasangle angle260 link7) (hasangle angle260 link8)
   added: (hasangle angle260 link2) (hasangle angle280 link3) (hasangle angle60 link4) (hasangle angle40 link5) (hasangle angle0 link6) (hasangle angle240 link7) (hasangle angle240 link8)
   goals met: 1 of 8
10. (increase_angle link6 angle0 angle20)
   deleted: (hasangle angle0 link6) (hasangle angle240 link7) (hasangle angle240 link8)
   added: (hasangle angle20 link6) (hasangle angle260 link7) (hasangle angle260 link8)
   goals met: 1 of 8
11. (increase_angle link6 angle20 angle40)
   deleted: (hasangle angle20 link6) (hasangle angle260 link7) (hasangle angle260 link8)
   added: (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   goals met: 1 of 8
12. (increase_angle link6 angle40 angle60)
   deleted: (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   added: (hasangle angle60 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   goals met: 2 of 8
13. (decrease_angle link2 angle260 angle240)
   deleted: (hasangle angle260 link2) (hasangle angle280 link3) (hasangle angle60 link4) (hasangle angle40 link5) (hasangle angle60 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   added: (hasangle angle240 link2) (hasangle angle260 link3) (hasangle angle40 link4) (hasangle angle20 link5) (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   goals met: 0 of 8
14. (decrease_angle link1 angle180 angle160)
   deleted: (hasangle angle180 link1) (hasangle angle240 link2) (hasangle angle260 link3) (hasangle angle40 link4) (hasangle angle20 link5) (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   added: (hasangle angle160 link1) (hasangle angle220 link2) (hasangle angle240 link3) (hasangle angle20 link4) (hasangle angle0 link5) (hasangle angle20 link6) (hasangle angle260 link7) (hasangle angle260 link8)
   goals met: 0 of 8
15. (increase_angle link3 angle240 angle260)
   deleted: (hasangle angle240 link3) (hasangle angle20 link4) (hasangle angle0 link5) (hasangle angle20 link6) (hasangle angle260 link7) (hasangle angle260 link8)
   added: (hasangle angle260 link3) (hasangle angle40 link4) (hasangle angle20 link5) (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   goals met: 0 of 8
16. (increase_angle link3 angle260 angle280)
   deleted: (hasangle angle260 link3) (hasangle angle40 link4) (hasangle angle20 link5) (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   added: (hasangle angle280 link3) (hasangle angle60 link4) (hasangle angle40 link5) (hasangle angle60 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   goals met: 2 of 8
17. (decrease_angle link5 angle40 angle20)
   deleted: (hasangle angle40 link5) (hasangle angle60 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   added: (hasangle angle20 link5) (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   goals met: 1 of 8
18. (increase_angle link6 angle40 angle60)
   deleted: (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   added: (hasangle angle60 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   goals met: 2 of 8
19. (decrease_angle link2 angle220 angle200)
   deleted: (hasangle angle220 link2) (hasangle angle280 link3) (hasangle angle60 link4) (hasangle angle20 link5) (hasangle angle60 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   added: (hasangle angle200 link2) (hasangle angle260 link3) (hasangle angle40 link4) (hasangle angle0 link5) (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   goals met: 1 of 8
20. (increase_angle link6 angle40 angle60)
   deleted: (hasangle angle40 link6) (hasangle angle280 link7) (hasangle angle280 link8)
   added: (hasangle angle60 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   goals met: 2 of 8
21. (increase_angle link3 angle260 angle280)
   deleted: (hasangle angle260 link3) (hasangle angle40 link4) (hasangle angle0 link5) (hasangle angle60 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   added: (hasangle angle280 link3) (hasangle angle60 link4) (hasangle angle20 link5) (hasangle angle80 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   goals met: 3 of 8
22. (decrease_angle link7 angle320 angle300)
   deleted: (hasangle angle320 link7) (hasangle angle320 link8)
   added: (hasangle angle300 link7) (hasangle angle300 link8)
   goals met: 3 of 8
23. (increase_angle link6 angle80 angle100)
   deleted: (hasangle angle80 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   added: (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   goals met: 3 of 8
24. (decrease_angle link4 angle60 angle40)
   deleted: (hasangle angle60 link4) (hasangle angle20 link5) (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   added: (hasangle angle40 link4) (hasangle angle0 link5) (hasangle angle80 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   goals met: 2 of 8
25. (increase_angle link6 angle80 angle100)
   deleted: (hasangle angle80 link6) (hasangle angle300 link7) (hasangle angle300 link8)
   added: (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   goals met: 2 of 8
26. (increase_angle link6 angle100 angle120)
   deleted: (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   added: (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle340 link8)
   goals met: 2 of 8
27. (decrease_angle link5 angle0 angle340)
   deleted: (hasangle angle0 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle340 link8)
   added: (hasangle angle340 link5) (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   goals met: 2 of 8
28. (increase_angle link3 angle280 angle300)
   deleted: (hasangle angle280 link3) (hasangle angle40 link4) (hasangle angle340 link5) (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   added: (hasangle angle300 link3) (hasangle angle60 link4) (hasangle angle0 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle340 link8)
   goals met: 3 of 8
29. (decrease_angle link4 angle60 angle40)
   deleted: (hasangle angle60 link4) (hasangle angle0 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle340 link8)
   added: (hasangle angle40 link4) (hasangle angle340 link5) (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   goals met: 2 of 8
30. (increase_angle link3 angle300 angle320)
   deleted: (hasangle angle300 link3) (hasangle angle40 link4) (hasangle angle340 link5) (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   added: (hasangle angle320 link3) (hasangle angle60 link4) (hasangle angle0 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle340 link8)
   goals met: 3 of 8
31. (decrease_angle link4 angle60 angle40)
   deleted: (hasangle angle60 link4) (hasangle angle0 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle340 link8)
   added: (hasangle angle40 link4) (hasangle angle340 link5) (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle320 link8)
   goals met: 2 of 8
32. (decrease_angle link8 angle320 angle300)
   deleted: (hasangle angle320 link8)
   added: (hasangle angle300 link8)
   goals met: 3 of 8
33. (increase_angle link6 angle100 angle120)
   deleted: (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle300 link8)
   added: (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   goals met: 2 of 8
34. (decrease_angle link2 angle200 angle180)
   deleted: (hasangle angle200 link2) (hasangle angle320 link3) (hasangle angle40 link4) (hasangle angle340 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   added: (hasangle angle180 link2) (hasangle angle300 link3) (hasangle angle20 link4) (hasangle angle320 link5) (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle300 link8)
   goals met: 3 of 8
35. (increase_angle link1 angle160 angle180)
   deleted: (hasangle angle160 link1) (hasangle angle180 link2) (hasangle angle300 link3) (hasangle angle20 link4) (hasangle angle320 link5) (hasangle angle100 link6) (hasangle angle320 link7) (hasangle angle300 link8)
   added: (hasangle angle180 link1) (hasangle angle200 link2) (hasangle angle320 link3) (hasangle angle40 link4) (hasangle angle340 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   goals met: 2 of 8
36. (increase_angle link3 angle320 angle340)
   deleted: (hasangle angle320 link3) (hasangle angle40 link4) (hasangle angle340 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   added: (hasangle angle340 link3) (hasangle angle60 link4) (hasangle angle0 link5) (hasangle angle140 link6) (hasangle angle0 link7) (hasangle angle340 link8)
   goals met: 2 of 8
37. (decrease_angle link5 angle0 angle340)
   deleted: (hasangle angle0 link5) (hasangle angle140 link6) (hasangle angle0 link7) (hasangle angle340 link8)
   added: (hasangle angle340 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   goals met: 3 of 8
38. (increase_angle link1 angle180 angle200)
   deleted: (hasangle angle180 link1) (hasangle angle200 link2) (hasangle angle340 link3) (hasangle angle60 link4) (hasangle angle340 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   added: (hasangle angle200 link1) (hasangle angle220 link2) (hasangle angle0 link3) (hasangle angle80 link4) (hasangle angle0 link5) (hasangle angle140 link6) (hasangle angle0 link7) (hasangle angle340 link8)
   goals met: 1 of 8
39. (decrease_angle link5 angle0 angle340)
   deleted: (hasangle angle0 link5) (hasangle angle140 link6) (hasangle angle0 link7) (hasangle angle340 link8)
   added: (hasangle angle340 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   goals met: 2 of 8
40. (increase_angle link3 angle0 angle20)
   deleted: (hasangle angle0 link3) (hasangle angle80 link4) (hasangle angle340 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   added: (hasangle angle20 link3) (hasangle angle100 link4) (hasangle angle0 link5) (hasangle angle140 link6) (hasangle angle0 link7) (hasangle angle340 link8)
   goals met: 1 of 8
41. (increase_angle link6 angle140 angle160)
   deleted: (hasangle angle140 link6) (hasangle angle0 link7) (hasangle angle340 link8)
   added: (hasangle angle160 link6) (hasangle angle20 link7) (hasangle angle0 link8)
   goals met: 1 of 8
42. (decrease_angle link2 angle220 angle200)
   deleted: (hasangle angle220 link2) (hasangle angle20 link3) (hasangle angle100 link4) (hasangle angle0 link5) (hasangle angle160 link6) (hasangle angle20 link7) (hasangle angle0 link8)
   added: (hasangle angle200 link2) (hasangle angle0 link3) (hasangle angle80 link4) (hasangle angle340 link5) (hasangle angle140 link6) (hasangle angle0 link7) (hasangle angle340 link8)
   goals met: 2 of 8
43. (decrease_angle link4 angle80 angle60)
   deleted: (hasangle angle80 link4) (hasangle angle340 link5) (hasangle angle140 link6) (hasangle angle0 link7) (hasangle angle340 link8)
   added: (hasangle angle60 link4) (hasangle angle320 link5) (hasangle angle120 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   goals met: 5 of 8
44. (decrease_angle link7 angle340 angle320)
   deleted: (hasangle angle340 link7) (hasangle angle320 link8)
   added: (hasangle angle320 link7) (hasangle angle300 link8)
   goals met: 7 of 8
45. (decrease_angle link7 angle320 angle300)
   deleted: (hasangle angle320 link7) (hasangle angle300 link8)
   added: (hasangle angle300 link7) (hasangle angle280 link8)
   goals met: 5 of 8
46. (increase_angle link3 angle0 angle20)
   deleted: (hasangle angle0 link3) (hasangle angle60 link4) (hasangle angle320 link5) (hasangle angle120 link6) (hasangle angle300 link7) (hasangle angle280 link8)
   added: (hasangle angle20 link3) (hasangle angle80 link4) (hasangle angle340 link5) (hasangle angle140 link6) (hasangle angle320 link7) (hasangle angle300 link8)
   goals met: 4 of 8
47. (increase_angle link3 angle20 angle40)
   deleted: (hasangle angle20 link3) (hasangle angle80 link4) (hasangle angle340 link5) (hasangle angle140 link6) (hasangle angle320 link7) (hasangle angle300 link8)
   added: (hasangle angle40 link3) (hasangle angle100 link4) (hasangle angle0 link5) (hasangle angle160 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   goals met: 2 of 8
48. (decrease_angle link4 angle100 angle80)
   deleted: (hasangle angle100 link4) (hasangle angle0 link5) (hasangle angle160 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   added: (hasangle angle80 link4) (hasangle angle340 link5) (hasangle angle140 link6) (hasangle angle320 link7) (hasangle angle300 link8)
   goals met: 4 of 8
49. (increase_angle link3 angle40 angle60)
   deleted: (hasangle angle40 link3) (hasangle angle80 link4) (hasangle angle340 link5) (hasangle angle140 link6) (hasangle angle320 link7) (hasangle angle300 link8)
   added: (hasangle angle60 link3) (hasangle angle100 link4) (hasangle angle0 link5) (hasangle angle160 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   goals met: 3 of 8
50. (decrease_angle link4 angle100 angle80)
   deleted: (hasangle angle100 link4) (hasangle angle0 link5) (hasangle angle160 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   added: (hasangle angle80 link4) (hasangle angle340 link5) (hasangle angle140 link6) (hasangle angle320 link7) (hasangle angle300 link8)
   goals met: 5 of 8
51. (increase_angle link7 angle320 angle340)
   deleted: (hasangle angle320 link7) (hasangle angle300 link8)
   added: (hasangle angle340 link7) (hasangle angle320 link8)
   goals met: 3 of 8
52. (decrease_angle link4 angle80 angle60)
   deleted: (hasangle angle80 link4) (hasangle angle340 link5) (hasangle angle140 link6) (hasangle angle340 link7) (hasangle angle320 link8)
   added: (hasangle angle60 link4) (hasangle angle320 link5) (hasangle angle120 link6) (hasangle angle320 link7) (hasangle angle300 link8)
   goals met: 8 of 8
